Revit 2024 API
Document.NewExtrusionRoof Method
Creates a new Extrusion Roof.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ExtrusionRoof NewExtrusionRoof(
	CurveArray profile,
	ReferencePlane refPlane,
	Level level,
	RoofType roofType,
	double extrusionStart,
	double extrusionEnd
)
Visual Basic
Public Function NewExtrusionRoof ( _
	profile As CurveArray, _
	refPlane As ReferencePlane, _
	level As Level, _
	roofType As RoofType, _
	extrusionStart As Double, _
	extrusionEnd As Double _
) As ExtrusionRoof
Visual C++
public:
ExtrusionRoof^ NewExtrusionRoof(
	CurveArray^ profile,
	ReferencePlane^ refPlane,
	Level^ level,
	RoofType^ roofType,
	double extrusionStart,
	double extrusionEnd
)
Parameters
profile
Type: Autodesk.Revit.DB.CurveArray
The profile of the extrusion roof. The curves of the profile must be contiguous and form one open loop without self-intersections. The profile curves must lie in the %refPlane% parallel to z-axis.
refPlane
Type: Autodesk.Revit.DB.ReferencePlane
The work plane for the extrusion roof. It must be parallel to z-axis.
level
Type: Autodesk.Revit.DB.Level
The level of the extrusion roof.
roofType
Type: Autodesk.Revit.DB.RoofType
Type of the extrusion roof.
extrusionStart
Type: System.Double
Start the extrusion. Measured from %refPlane% in the direction of the plane normal.
extrusionEnd
Type: System.Double
End the extrusion. Measured from %refPlane% in the direction of the plane normal.
Remarks
 This method will regenerate the document even in manual regeneration mode.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the work plane does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the level does not exist in the given document.
Autodesk.Revit.Exceptions.ArgumentException | Thrown if the roof type does not exist in the given document.
See Also
Document Class
Autodesk.Revit.Creation Namespace